# Сообщения пользователю
PASSED = 'Экзамен сдан! Количество правильных ответов: '
FAILED = 'Экзамен не сдан! Возможно тебе стоит потренироваться (/training)\n' \
         'Количество правильных ответов: '
EXAM_STARTED = 'Экзамен начался! Удачи!'

# Команды
WELCOME = 'Добро пожаловать в тренажёр ПДД\n\n' \
          'Здесь ты можешь тренировать свои знания в двум режимах:\n' \
          '1. Режим тренировки (/training). После каждого вопроса\n' \
          'ты узнаешь правильный ответ и комментарий к вопросу. \n' \
          '2. Режим Экзамена (/exam). Тебе будет задано 20 вопросов.\n' \
          'В конце ты узнаешь количество набранных баллов и результат экзамена\n\n'

# Кнопки бота
ONE = '1️⃣'
TWO = '2️⃣'
THREE = '3️⃣'
FOUR = '4️⃣'
MENU = 'Вернуться в меню'
SOS = 'Комментарий к вопросу'
NEXT = 'Следующий вопрос️'
AGAIN = 'Пересдать экзамен'