questions = [
        [
        'Билет 1 - Вопрос 1\n\
В каком случае водитель совершит вынужденную остановку?\n\
1. Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу.\n\
2. Остановившись на проезжей части из-за технической неисправности транспортного средства.\n\
3. В обоих перечисленных случаях.'
        ,'Билет 1 - Вопрос 2\n\
Разрешен ли Вам съезд на дорогу с грунтовым покрытием?\n\
1. Разрешен.\n\
2. Разрешен только при технической неисправности транспортного средства.\n\
3. Запрещен.'
        ,'Билет 1 - Вопрос 3\n\
Можно ли Вам остановиться в указанном месте для посадки пассажира?\n\
1. Можно.\n\
2. Можно, если Вы управляете такси.\n\
3. Нельзя.'
        ,'Билет 1 - Вопрос 4\n\
Какие из указанных знаков запрещают движение водителям мопедов?\n\
1. Только А.\n\
2. Только Б.\n\
3. В и Г.\n\
4. Все.'
        ,'Билет 1 - Вопрос 5\n\
Вы намерены повернуть налево. Где следует остановиться, чтобы уступить дорогу легковому автомобилю?\n\
1. Перед знаком.\n\
2. Перед перекрестком у линии разметки.\n\
3. На перекрестке перед прерывистой линией разметки.\n\
4. В любом месте по усмотрению водителя.'
        ,'Билет 1 - Вопрос 6\n\
Что означает мигание зеленого сигнала светофора?\n\
1. Предупреждает о неисправности светофора.\n\
2. Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал.\n\
3. Запрещает дальнейшее движение.'
        ,'Билет 1 - Вопрос 7\n\
Водитель обязан подавать сигналы световыми указателями поворота (рукой):\n\
1. Перед началом движения или перестроением.\n\
2. Перед поворотом или разворотом.\n\
3. Перед остановкой.\n\
4. Во всех перечисленных случаях.'
        ,'Билет 1 - Вопрос 8\n\
Как Вам следует поступить при повороте направо?\n\
1. Перестроиться на правую полосу, затем осуществить поворот.\n\
2. Продолжить движение по второй полосе до перекрестка, затем повернуть.\n\
3. Возможны оба варианта действий.'
        ,'Билет 1 - Вопрос 9\n\
По какой траектории Вам разрешено выполнить разворот?\n\
1. Только по А.\n\
2. Только по Б.\n\
3. По любой из указанных.'
        ,'Билет 1 - Вопрос 10\n\
С какой скоростью Вы можете продолжить движение вне населенного пункта по левой полосе на легковом автомобиле?\n\
1. Не более 50 км/ч.\n\
2. Не менее 50 км/ч и не более 70 км/ч.\n\
3. Не менее 50 км/ч и не более 90 км/ч.'
        ,'Билет 1 - Вопрос 11\n\
Можно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?\n\
1. Можно.\n\
2. Можно, если скорость грузовых автомобилей менее 30 км/ч.\n\
3. Нельзя.'
        ,'Билет 1 - Вопрос 12\n\
В каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?\n\
1. Только если расстояние до сплошной линии разметки не менее 3 м.\n\
2. Только если расстояние до края пересекаемой проезжей части не менее 5 м.\n\
3. При соблюдении обоих перечисленных условий.'
        ,'Билет 1 - Вопрос 13\n\
При повороте направо Вы должны уступить дорогу:\n\
1. Только велосипедисту.\n\
2. Только пешеходам.\n\
3. Пешеходам и велосипедисту.\n\
4. Никому.'
        ,'Билет 1 - Вопрос 14\n\
Вы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?\n\
1. Обоим трамваям.\n\
2. Только трамваю А.\n\
3. Только трамваю Б.\n\
4. Никому.'
        ,'Билет 1 - Вопрос 15\n\
Кому Вы обязаны уступить дорогу при повороте налево?\n\
1. Только автобусу.\n\
2. Только легковому автомобилю.\n\
3. Никому.'
        ,'Билет 1 - Вопрос 16\n\
С какой максимальной скоростью можно продолжить движение за знаком?\n\
1. 60 км/ч.\n\
2. 50 км/ч.\n\
3. 30 км/ч.\n\
4. 20 км/ч.'
        ,'Билет 1 - Вопрос 17\n\
Для перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:\n\
1. Категории «A» или подкатегории «A1».\n\
2. Любой категории или подкатегории в течение двух и более лет.\n\
3. Только категории «A» или подкатегории «A1» в течение двух и более лет.'
        ,'Билет 1 - Вопрос 18\n\
При какой неисправности разрешается эксплуатация транспортного средства?\n\
1. Не работают пробки топливных баков.\n\
2. Не работает механизм регулировки положения сиденья водителя.\n\
3. Не работают устройства обогрева и обдува стекол.\n\
4. Не работает стеклоподъемник.'
        ,'Билет 1 - Вопрос 19\n\
В случае, когда правые колеса автомобиля наезжают на неукрепленную влажную обочину, рекомендуется:\n\
1. Затормозить и полностью остановиться.\n\
2. Затормозить и плавно направить автомобиль на проезжую часть.\n\
3. Не прибегая к торможению, плавно направить автомобиль на проезжую часть.'
        ,'Билет 1 - Вопрос 20\n\
Что понимается под временем реакции водителя?\n\
1. Время с момента обнаружения водителем опасности до полной остановки транспортного средства.\n\
2. Время с момента обнаружения водителем опасности до начала принятия мер по ее избежанию.\n\
3. Время, необходимое для переноса ноги с педали управления подачей топлива на педаль тормоза.'],

        ['Билет 2 - Вопрос 1\n\
Сколько полос для движения имеет данная дорога?\n\
1. Две.\n\
2. Четыре.\n\
3. Пять.'
        ,'Билет 2 - Вопрос 2\n\
Можно ли Вам въехать на мост первым?\n\
1. Можно.\n\
2. Можно, если Вы не затрудните движение встречному автомобилю.\n\
3. Нельзя.'
        ,'Билет 2 - Вопрос 3\n\
Разрешено ли Вам произвести остановку для посадки пассажира?\n\
1. Разрешено.\n\
2. Разрешено только по четным числам месяца.\n\
3. Разрешено только по нечетным числам месяца.\n\
4. Запрещено.'
        ,'Билет 2 - Вопрос 4\n\
Что запрещено в зоне действия этого знака?\n\
1. Движение любых транспортных средств.\n\
2. Движение всех транспортных средств со скоростью не более 20 км/ч.\n\
3. Движение механических транспортных средств.'
        ,'Билет 2 - Вопрос 5\n\
Разрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?\n\
1. Разрешен.\n\
2. Разрешен, если скорость автобуса менее 30 км/ч.\n\
3. Запрещен.'
        ,'Билет 2 - Вопрос 6\n\
В каких направлениях Вам разрешается продолжить движение?\n\
1. Только налево.\n\
2. Прямо и налево.\n\
3. Налево и в обратном направлении.'
        ,'Билет 2 - Вопрос 7\n\
Поднятая вверх рука водителя легкового автомобиля является сигналом, информирующим Вас о его намерении:\n\
1. Повернуть направо.\n\
2. Продолжить движение прямо.\n\
3. Снизить скорость, чтобы остановиться и уступить дорогу мотоциклу.'
        ,'Билет 2 - Вопрос 8\n\
Двигаясь по левой полосе, водитель намерен перестроиться на правую. На каком из рисунков показана ситуация, в которой он обязан уступить дорогу?\n\
1. На левом.\n\
2. На правом.\n\
3. На обоих.'
        ,'Билет 2 - Вопрос 9\n\
Можно ли Вам выполнить разворот в этом месте?\n\
1. Можно.\n\
2. Можно только при отсутствии приближающегося поезда.\n\
3. Нельзя.'
        ,'Билет 2 - Вопрос 10\n\
В каких случаях разрешается наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?\n\
1. Только если на дороге нет других транспортных средств.\n\
2. Только при движении в темное время суток.\n\
3. Только при перестроении.\n\
4. Во всех перечисленных случаях.'
        ,'Билет 2 - Вопрос 11\n\
Разрешено ли Вам обогнать мотоцикл?\n\
1. Разрешено.\n\
2. Разрешено, если водитель мотоцикла снизил скорость.\n\
3. Запрещено.'
        ,'Билет 2 - Вопрос 12\n\
Разрешается ли Вам остановиться в указанном месте?\n\
1. Разрешается.\n\
2. Разрешается, если автомобиль будет находиться не ближе 5 м от края пересекаемой проезжей части.\n\
3. Запрещается.'
        ,'Билет 2 - Вопрос 13\n\
Вы намерены повернуть налево. Кому Вы должны уступить дорогу?\n\
1. Только пешеходам.\n\
2. Только автобусу.\n\
3. Автобусу и пешеходам.'
        ,'Билет 2 - Вопрос 14\n\
В каком случае Вы имеете преимущество?\n\
1. Только при повороте направо.\n\
2. Только при повороте налево.\n\
3. В обоих перечисленных случаях.'
        ,'Билет 2 - Вопрос 15\n\
Обязан ли водитель мотоцикла уступить Вам дорогу?\n\
1. Обязан.\n\
2. Не обязан.'
        ,'Билет 2 - Вопрос 16\n\
Разрешается ли водителю выполнить объезд грузового автомобиля?\n\
1. Разрешается.\n\
2. Разрешается, если между шлагбаумом и остановившимся грузовым автомобилем расстояние более 5 м.\n\
3. Запрещается.'
        ,'Билет 2 - Вопрос 17\n\
В каких из перечисленных случаев запрещена буксировка на гибкой сцепке?\n\
1. Только на горных дорогах.\n\
2. Только в гололедицу.\n\
3. Только в темное время суток и в условиях недостаточной видимости.\n\
4. Во всех перечисленных случаях.'
        ,'Билет 2 - Вопрос 18\n\
Запрещается эксплуатация мототранспортных средств (категории L), если остаточная глубина рисунка протектора шин (при отсутствии индикаторов износа) составляет не более:\n\
1. 0,8 мм.\n\
2. 1,0 мм.\n\
3. 1,6 мм.\n\
4. 2,0 мм.'
        ,'Билет 2 - Вопрос 19\n\
Картинка к вопросу\n\
Исключает ли антиблокировочная тормозная система возможность возникновения заноса или сноса при прохождении поворота?\n\
1. Полностью исключает возможность возникновения только заноса.\n\
2. Полностью исключает возможность возникновения только сноса.\n\
3. Не исключает возможность возникновения сноса или заноса.'
        ,'Билет 2 - Вопрос 20\n\
В каких случаях следует начинать сердечно-легочную реанимацию пострадавшего?\n\
1. При наличии болей в области сердца и затрудненного дыхания.\n\
2. При отсутствии у пострадавшего сознания, независимо от наличия дыхания.\n\
3. При отсутствии у пострадавшего сознания, дыхания и кровообращения.'],

        ['Билет 3 - Вопрос 1\n\
Выезжая с грунтовой дороги на перекресток, Вы попадаете:\n\
1. На главную дорогу.\n\
2. На равнозначную дорогу, поскольку отсутствуют знаки приоритета.\n\
3. На равнозначную дорогу, поскольку проезжая часть имеет твердое покрытие перед перекрестком.'
        ,'Билет 3 - Вопрос 2\n\
Где Вы должны остановиться?\n\
1. Перед знаком (А).\n\
2. Перед перекрестком (Б).\n\
3. Перед краем пересекаемой проезжей части (В).'
        ,'Билет 3 - Вопрос 3\n\
Вам необходимо двигаться со скоростью не более 40 км/ч:\n\
1. Только во время дождя.\n\
2. Во время выпадения осадков (дождя, града, снега).\n\
3. Во всех случаях, когда покрытие проезжей части влажное.'
        ,'Билет 3 - Вопрос 4\n\
Какой из указанных знаков устанавливается в начале дороги с односторонним движением?\n\
1. Только А.\n\
2. Только Б.\n\
3. Б или Г.\n\
4. Б или В.'
        ,'Билет 3 - Вопрос 5\n\
Можно ли Вам остановиться в этом месте для посадки или высадки пассажиров?\n\
1. Можно.\n\
2. Можно, если при этом не будут созданы помехи движению маршрутных транспортных средств.\n\
3. Нельзя.'
        ,'Билет 3 - Вопрос 6\n\
При повороте направо Вы:\n\
1. Имеете право проехать перекресток первым.\n\
2. Должны уступить дорогу только пешеходам.\n\
3. Должны уступить дорогу автомобилю с включенными проблесковым маячком и специальным звуковым сигналом, а также пешеходам.'
        ,'Билет 3 - Вопрос 7\n\
В каких случаях водитель не должен подавать сигнал указателями поворота?\n\
1. Только при отсутствии на дороге других участников движения.\n\
2. Только если сигнал может ввести в заблуждение других участников движения.\n\
3. В обоих перечисленных случаях.'
        ,'Билет 3 - Вопрос 8\n\
Вам разрешено выполнить поворот направо:\n\
1. Только по траектории А.\n\
2. Только по траектории Б.\n\
3. По любой траектории из указанных.'
        ,'Билет 3 - Вопрос 9\n\
Разрешается ли Вам выполнить разворот на перекрестке по указанной траектории?\n\
1. Разрешается.\n\
2. Разрешается, если видимость дороги не менее 100 м.\n\
3. Запрещается.'
        ,'Билет 3 - Вопрос 10\n\
По какой полосе Вы имеете право двигаться с максимальной разрешенной скоростью вне населенных пунктов?\n\
1. Только по правой.\n\
2. Только по левой.\n\
3. По любой.'
        ,'Билет 3 - Вопрос 11\n\
В каком случае водитель может начать обгон, если такой маневр на данном участке дороги не запрещен?\n\
1. Только если полоса, предназначенная для встречного движения, свободна на достаточном для обгона расстоянии.\n\
2. Только если его транспортное средство никто не обгоняет.\n\
3. В случае, если выполнены оба условия.'
        ,'Билет 3 - Вопрос 12\n\
Кто из водителей нарушил правила стоянки?\n\
1. Оба.\n\
2. Только водитель автомобиля.\n\
3. Только водитель мотоцикла.\n\
4. Никто не нарушил.'
        ,'Билет 3 - Вопрос 13\n\
При движении прямо Вы:\n\
1. Должны остановиться перед стоп-линией.\n\
2. Можете продолжить движение через перекресток без остановки.\n\
3. Должны уступить дорогу транспортным средствам, движущимся с других направлений.'
        ,'Билет 3 - Вопрос 14\n\
Вы намерены повернуть направо. Ваши действия?\n\
1. Проедете перекресток первым.\n\
2. Уступите дорогу легковому автомобилю.\n\
3. Уступите дорогу обоим транспортным средствам.'
        ,'Билет 3 - Вопрос 15\n\
Кому Вы обязаны уступить дорогу при повороте налево?\n\
1. Трамваям А и Б.\n\
2. Трамваю А и легковому автомобилю.\n\
3. Только трамваю А.\n\
4. Никому.'
        ,'Билет 3 - Вопрос 16\n\
Кто из водителей нарушил правила остановки?\n\
1. Только водитель легкового автомобиля.\n\
2. Только водитель грузового автомобиля.\n\
3. Оба.'
        ,'Билет 3 - Вопрос 17\n\
Какие из перечисленных требований предъявляются к обучаемому на автомобиле, допущенному к учебной езде на дорогах?\n\
1. Возраст не менее 16 лет.\n\
2. Знание Правил дорожного движения.\n\
3. Наличие первоначальных навыков управления.\n\
4. Все перечисленные требования.'
        ,'Билет 3 - Вопрос 18\n\
Какие из перечисленных транспортных средств разрешается эксплуатировать без огнетушителя?\n\
1. Только мотоциклы без бокового прицепа.\n\
2. Любые мотоциклы.\n\
3. Все мотоциклы и легковые автомобили.'
        ,'Билет 3 - Вопрос 19\n\
На повороте возник занос задней оси переднеприводного автомобиля. Ваши действия?\n\
1. Уменьшите подачу топлива, рулевым колесом стабилизируете движение.\n\
2. Притормозите и повернете рулевое колесо в сторону заноса.\n\
3. Слегка увеличите подачу топлива, корректируя направление движения рулевым колесом.\n\
4. Значительно увеличите подачу топлива, не меняя положения рулевого колеса.'
        ,'Билет 3 - Вопрос 20\n\
Какие сведения необходимо сообщить диспетчеру для вызова скорой медицинской помощи при дорожно-транспортном происшествии (ДТП)?\n\
1. Указать общеизвестные ориентиры, ближайшие к месту ДТП. Сообщить о количестве пострадавших, указать их пол и возраст.\n\
2. Указать улицу и номер дома, ближайшего к месту ДТП. Сообщить, кто пострадал в ДТП (пешеход, водитель автомобиля или пассажиры), и описать травмы, которые они получили.\n\
3. Указать место ДТП (назвать улицу, номер дома и общеизвестные ориентиры, ближайшие к месту ДТП). Сообщить: количество пострадавших, их пол, примерный возраст, наличие у них сознания, дыхания, кровообращения, а также сильного кровотечения, переломов и других травм. Дождаться сообщения диспетчера о том, что вызов принят.'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
        ]
answers = [
        ['2','1','1','4','2','2','4','3','1','3','1','3','3','1','3','4','3','4','3','2'],
        ['2','1','1','3','3','1','3','3','1','3','3','2','3','3','1','3','2','1','3','3'],
        ['1'
        ,'3'
        ,'3'
        ,'2'
        ,'2'
        ,'3'
        ,'2'
        ,'1'
        ,'3'
        ,'1'
        ,'3'
        ,'2'
        ,'2'
        ,'1'
        ,'3'
        ,'3'
        ,'4'
        ,'2'
        ,'3'
        ,'3'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

choices = [
        ['3','3','3','4','4','3','4','3','3','3','3','3','4','4','3','4','3','4','3','3'],
        ['3','3','4','3','3','3','3','3','3','4','3','3','3','3','3','3','4','4','3','3'],
        ['3'
        ,'3'
        ,'3'
        ,'4'
        ,'3'
        ,'3'
        ,'3'
        ,'3'
        ,'3'
        ,'3'
        ,'3'
        ,'4'
        ,'3'
        ,'3'
        ,'4'
        ,'3'
        ,'4'
        ,'3'
        ,'4'
        ,'3'],
        ['','','','','','','','','','','','','','','','','','','',''],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

comments = [
        ['Под вынужденной остановкой подразумевается прекращение движения ТС из-за его технической неисправности, опасности, создаваемой перевозимым грузом, внезапным ухудшением состояния водителя (или пассажира), а также появлением препятствия на дороге (упавший груз, завал на дороге и т. п.). Остановка, связанная с необходимостью выполнения требования уступить дорогу, не рассматривается как вынужденная (п. 1.2).'
        ,'Знаки 1.11.2  «Опасный поворот» и 1.34.2  «Направление поворота» указывают направление движения на закруглениях дороги малого радиуса с ограниченной видимостью, или, как их называют, «закрытых» поворотах. Эти знаки не ограничивают возможность съезда с дороги, в данном случае - на примыкающую справа грунтовую дорогу.'
        ,'Знак 3.28  «Стоянка запрещена» остановку не запрещает, поэтому Вы можете остановиться в указанном месте.'
        ,'Все указанные знаки запрещают движение водителям мопедов.'
        ,'Разметка 1.13  (в виде линии из треугольников) наносится поперек полосы движения и указывает место, где Вы должны при необходимости остановиться, выполняя требование знака 2.4  «Уступите дорогу» и предоставляя преимущество ТС, движущимся по пересекаемой дороге.'
        ,'Для информирования водителей о предстоящей смене зеленого сигнала светофора на желтый Правилами предусмотрена возможность мигания зеленого сигнала. Этот сигнал разрешает движение ТС (п. 6.2). Длительность мигания при этом должна составлять 3 сек.'
        ,'Перед началом движения, перестроением, поворотом (разворотом) и остановкой водитель обязан подавать сигналы световыми указателями поворота соответствующего направления, а если они отсутствуют или неисправны - рукой. (п. 8.1).'
        ,'Стрелы разметки 1.18  указывают, что на данном перекрестке поворот направо может осуществляться не только с правой, но и с левой полосы. Следовательно, Вы можете выполнить поворот, либо заранее перестроившись на крайнюю правую полосу (занять крайнее правое положение), либо продолжив движение по левой полосе (п. 8.5).'
        ,'Выполняя разворот на этом перекрестке, Вам придется использовать для движения участок проезжей части, имеющий двустороннее движение. Речь идет о пересекаемой Вами проезжей части. На ней двустороннее движение. Если Вы поедете по траектории Б, то попадете навстречу легковому автомобилю слева. Поэтому, въезжая на перекресток, Вы можете продолжить движение только по правой стороне этого участка проезжей части (п. 1.4), т.е. по траектории А.'
        ,'Знак 4.6  «Ограничение минимальной скорости» и табличка 8.14  «Полоса движения» предписывают двигаться по левой полосе со скоростью не менее 50 км/ч. Однако при этом на дороге вне населенного пункта, не относящейся к автомагистрали, Вы не имеете права развивать скорость на легковом автомобиле более 90 км/ч (п. 10.3).'
        ,'Вне населенных пунктов водители ТС должны вести их по возможности ближе к правому краю проезжей части. Однако можно последовательно опередить несколько ТС, следующих друг за другом на незначительной дистанции. Поскольку водитель легкового автомобиля приближается к перекрестку неравнозначных дорог, двигаясь по главной дороге (знак 2.3.1  «Пересечение со второстепенной дорогой»), имеющей 2 полосы для движения в данном направлении, то он может совершить опережение обоих грузовых автомобилей (п. 9.4).'
        ,'Остановившись за пешеходным переходом в 5 м от края пересекаемой проезжей части и обеспечив при этом расстояние в 3 м до сплошной линии разметки, водитель не нарушил правила стоянки (пп. 12.4 и 12.5).'
        ,'При повороте направо по разрешающему сигналу светофора Вы должны уступить дорогу как велосипедисту, так и пешеходам (п. 13.1).'
        ,'В данной ситуации Вы должны уступить дорогу обоим трамваям, так как на перекрестке равнозначных дорог трамвай имеет преимущество перед безрельсовыми ТС независимо от направления его движения (п. 13.11).'
        ,'Проезжая данный перекресток неравнозначных дорог по направлению главной дороги (знаки 2.1  «Главная дорога» и 8.13  «Направление главной дороги»), Вы никому не должны уступать дорогу, так как пользуетесь преимуществом как перед находящимся на главной дороге автобусом, для которого Вы являетесь «помехой справа» (пп. 13.10 и 13.11), так и перед легковым автомобилем, движущимся по второстепенной дороге (п. 13.9).'
        ,'Знак 5.21  «Жилая зона» показывает, что Вы въезжаете на территорию, где скорость не должна превышать 20 км/ч (п. 10.2).'
        ,'Перевозка людей на мотоцикле должна осуществляться водителем, имеющим водительское удостоверение на право управления ТС категории «A» или подкатегории «A1» в течение двух и более лет (п. 22.21).'
        ,'Из всех перечисленных неисправностей только неработающий стеклоподъемник не является причиной запрещения эксплуатации ТС. Остальные неисправности включены в Перечень (п. 7.4), и при их наличии эксплуатация ТС запрещена.'
        ,'При съезде автомобиля правыми колесами на неукрепленную и влажную обочину возникает опасность заноса из-за разницы сцепления правых и левых колес с дорогой. При этом целесообразно, не меняя скорости, т.е. не прибегая к торможению, плавным поворотом рулевого колеса вернуть автомобиль на проезжую часть. Торможение в данной ситуации может вызвать занос автомобиля.'
        ,'Под временем реакции водителя подразумевается время с момента обнаружения опасности до начала принятия мер по избежанию опасности. В зависимости от состояния водителя и его опыта, а также сложности обстановки, в которой он находится, это время обычно составляет от 0,4 до 1,6 секунды.'],
        ['При наличии разделительной полосы дорога имеет две проезжие части, каждая из которых разделена разметкой на две полосы (п. 1.2).'
        ,'Знак 2.7  «Преимущество перед встречным движением» дает Вам право первым въехать на узкий мост, поскольку водитель встречного автомобиля в этой ситуации должен уступить дорогу тем, кто находится не только на мосту, но и на противоположном подъезде к нему.'
        ,'Знак 3.29  «Стоянка запрещена по нечетным числам месяца» запрещает только стоянку. Следовательно, остановиться в этом месте, в том числе и для посадки пассажиров, Вы можете в любой день месяца.'
        ,'Знак 5.33  «Пешеходная зона» обозначает место, с которого начинается территория (участок дороги), на которой разрешено движение только пешеходов, а также велосипедистов в случаях, установленных в пп. 24.2 - 24.4 Правил. Таким образом, запрещено движение только механических ТС. (Изменения от 25 июля 2017 года).'
        ,'В случае, если реверсивные светофоры выключены, въезд на полосу, обозначенную с двух сторон разметкой 1.9 , запрещен (п. 6.7).'
        ,'Дополнительная секция с включенным сигналом в виде зеленой стрелки, знак 5.15.1  "Направления движения по полосам" и разметка 1.18  разрешают Вам с правой полосы только поворот налево. Движение прямо запрещает красный сигнал светофора, а разворот запрещен, так как правила предписывают производить разворот только с крайней левой полосы (п. 8.5). Поворот направо запрещен при любом сигнале.'
        ,'Для выполнения требования знака 2.4  «Уступите дорогу» водитель легкового автомобиля должен снизить скорость и остановиться, чтобы уступить дорогу мотоциклисту. Об этом он и информирует Вас поднятой вверх рукой (п. 8.1).'
        ,'При перестроении с левой полосы на правую водитель должен уступить дорогу легковому автомобилю, движущемуся по правой полосе, как при его движении прямо, так и в случае одновременного перестроения (п. 8.4).'
        ,'Разворот запрещен непосредственно на самих железнодорожных переездах (п. 8.11). Перед переездом разворот разрешен.'
        ,'Наезжать на прерывистые линии разметки разрешается только при перестроении (п. 9.7).'
        ,'Водитель мотоцикла и Вы приближаетесь к нерегулируемому перекрестку равнозначных дорог, на котором обгон запрещен (п. 11.4). Кроме того, справа находится легковой автомобиль, которому водитель мотоцикла и Вы обязаны уступить дорогу (п. 13.11).'
        ,'Вам разрешается остановиться в указанном месте только в том случае, если автомобиль будет находиться не ближе 5 м от края пересекаемой проезжей части, т.е расстояние от остановившегося автомобиля как спереди, так и сзади него до соответствующего края пересекаемой проезжей части будет составлять не менее 5 м (п. 12.4).'
        ,'Перекресток, на который Вы въезжаете, - регулируемый, поэтому очередность движения на нем определяется не знаками приоритета, а сигналами светофора (пп. 6.15 и 13.3). Поворачивая налево, Вы должны уступить дорогу автобусу, движущемуся со встречного направления прямо (п. 13.4), а завершая поворот,— и пешеходам, переходящим проезжую часть дороги, на которую Вы поворачиваете (п. 13.1).'
        ,'Находящийся слева грузовой автомобиль должен уступить Вам дорогу (п. 13.11), и поэтому данный перекресток равнозначных дорог Вы проедете первым независимо от направления движения.'
        ,'Вы находитесь на автомагистрали, о чем свидетельствует знак 5.1  «Автомагистраль», а мотоцикл въезжает на нее по полосе разгона. Автомагистраль является главной дорогой по отношению к примыкающим (пп. 13.9 и 1.2 , термин «Главная дорога»). В данной ситуации водитель мотоцикла должен уступить Вам дорогу (п. 8.10).'
        ,'Водитель грузового автомобиля остановился перед железнодорожным переездом, а объезд стоящих перед переездом ТС с выездом на полосу встречного движения запрещен (п. 15.3).'
        ,'Буксировка на гибкой сцепке запрещена только в гололедицу (п. 20.4) из-за высокой вероятности заноса при торможении или трогании с места.'
        ,'Для мототранспортных средств, относящихся к ТС категории L, остаточная глубина рисунка протектора шин, при которой запрещается эксплуатация ТС, составляет не более 0,8 мм (Перечень, п. 5.1).'
        ,'При прохождении поворота на ТС действует центробежная сила, которая возрастает с увеличением скорости и стремится сместить ТС к внешней стороне закругления дороги. Занос или снос ТС может возникнуть при проезде поворота из-за большой скорости движения, торможения или низкого коэффициента сцепления. Антиблокировочная тормозная система, предназначенная для предотвращения блокировки колес ТС, может снизить вероятность возникновения заноса или сноса при торможении, но не может исключить возможность их возникновения.'
        ,'Сердечно-легочная реанимация проводится только при отсутствии у пострадавшего признаков жизни: потере сознания, отсутствии пульса на сонной артерии, а также признаков дыхания.'],
        ['О том, что Вы выезжаете со второстепенной дороги на главную могут информировать знаки 2.4  «Уступите дорогу» или 2.5  «Движение без остановки запрещено», установленные непосредственно перед выездом на нее. Кроме того, второстепенной является грунтовая дорога по отношению к дороге с твердым покрытием (п. 1.2). Наличие на второстепенной дороге непосредственно перед перекрестком участка дороги с покрытием не делает ее равной по значению с пересекаемой. Такие участки на грунтовых дорогах устраивают для того, чтобы грязь с них не выносилась на главную дорогу.'
        ,'Знак 2.5  «Движение без остановки запрещено» применяется при ограниченной видимости пересекаемой дороги и поэтому независимо от наличия на ней ТС требует обязательной остановки. В данном случае Вы должны остановиться перед краем пересекаемой проезжей части (место В). При наличии разметки 1.12  (стоп-линия) останавливаться следует перед такой линией.'
        ,'Табличка 8.16  «Влажное покрытие» информирует о том, что запрещение движения со скоростью более 40 км/ч, вводимое знаком 3.24  «Ограничение максимальной скорости», действует только в период времени, когда покрытие проезжей части влажное (например, во время дождя или сразу после его окончания).'
        ,'В начале дороги с односторонним движением устанавливается знак Б (5.5  «Дорога с односторонним движением»). Знак А (5.14  «Полоса для маршрутных транспортных средств») обозначает полосу для маршрутных ТС, знак В (6.14.2  «Номер маршрута») указывает номер и направление маршрута на перекрестке, а знак Г (6.15.1  «Направление движения для грузовых автомобилей») - рекомендуемое направление движения для грузовых автомобилей.'
        ,'Разметка 1.17  (в виде желтой зигзагообразной линии) применяется для обозначения мест остановок маршрутных ТС и стоянок такси. В данной ситуации Вы можете остановиться для посадки или высадки пассажиров в обозначенной разметкой 1.17  зоне, если не создадите помех движению маршрутных автобусов или троллейбусов. (п. 12.4).'
        ,'Водитель автомобиля с включенными проблесковым маячком синего цвета и специальным звковым сигналом имеет преимущество перед другими участниками движения (п. 3.1). Значит, Вы должны уступить ему дорогу и только после этого можете повернуть направо, уступая дорогу также и пешеходам (пп. 3.2 и 13.1).'
        ,'Водитель не должен подавать предупредительный сигнал указателями поворота только в том случае, если этот сигнал может ввести в заблуждение других участников движения. Во всех других случаях он обязан информировать о своих намерениях включением сигнала даже при отсутствии на дороге других участников движения (п. 8.2).'
        ,'Поворачивая направо, Вы не должны оказаться на стороне встречного движения, поэтому поворот разрешено выполнить по траектории А (п. 8.6).'
        ,'На перекрестке Вы можете совершить разворот только из крайнего левого положения (п. 8.5).'
        ,'Вне населенного пункта запрещается занимать левые полосы при свободных правых (п. 9.4). В данной ситуации Вы можете двигаться только по правой полосе независимо от скорости движения.'
        ,'Водитель может начать обгон с выездом на полосу встречного движения, если не создаст помех не только встречным, но и обгоняющим ТС (пп. 11.1 и 11.2 ПДД).'
        ,'В данной ситуации нарушил правила стоянки только водитель легкового автомобиля, так как использовал для стоянки тротуар (п. 12.2). Стоянка на расстоянии менее 3 м до прерывистой линии разметки 1.11  не запрещается (п. 12.4).'
        ,'Вы приближаетесь к регулируемому перекрестку и можете проехать его без остановки, поскольку включен зеленый, разрешающий сигнал светофора (п. 6.15 ПДД). Выполнять требование знака 2.5  «Движение без остановки запрещено» Вы должны только в том случае, если светофор будет выключен или переведен на режим желтого мигающего сигнала (п. 13.3 ПДД).'
        ,'На данном перекрестке дорогу мотоциклу уступать не надо - он не является помехой справа (п. 13.11 ПДД), поскольку, при повороте направо Вы не пересекаете путь его движения. Перед легковым автомобилем, поворачивающим налево, преимущество за Вами (п. 13.12 ПДД).'
        ,'Двигаясь на данном перекрестке по направлению главной дороги (знаки 2.1  «Главная дорога» и 8.13  «Направление главной дороги»), для определения очередности проезда с трамваем А и легковым автомобилем Вы должны руководствоваться правилами проезда перекрестков равнозначных дорог (п. 13.10 ПДД). В соответствии с ними преимущество имеет трамвай А (п. 13.11 ПДД). По этим же правилам легковой автомобиль, находящийся от Вас слева, обязан уступить дорогу. Также уступает Вам дорогу и трамвай Б, движущийся по второстепенной дороге (п. 13.9 ПДД).'
        ,'Оба водителя нарушили правила остановки, так как на автомагистралях остановка разрешена только на специальных площадках для стоянки, обозначенных знаками 6.4  «Парковка (парковочное место)» или 7.11  «Место отдыха» (п. 16.1). Кроме того, водитель легкового автомобиля остановился слева от краевой линии, т.е. на проезжей части (п. 12.1).'
        ,'При обучении вождению на дорогах обучаемый должен отвечать всем перечисленным требованиям (пп. 21.2 и 21.4). При отсутствии навыков управления и знаний ПДД первоначальное обучение вождению должно проводиться на закрытых площадках или автодромах (п. 21.1).'
        ,'Мотоциклы могут эксплуатироваться без огнетушителя, а легковым и грузовым автомобилям, автобусам и колесным тракторам при отсутствии огнетушителя эксплуатация запрещается (Перечень, п. 7.7).'
        ,'Занос переднеприводного автомобиля может возникнуть при торможении на повороте из-за «набегания» задних колес на передние. В этом случае целесообразно слегка увеличить подачу топлива (не вызывая пробуксовки передних колес) и дальнейшим поворотом рулевого колеса скорректировать направление движения автомобиля. Следует помнить, что на заднеприводном автомобиле увеличение скорости может только усилить возникший занос.'
        ,'Быстрота приезда скорой медицинской помощи во многом зависит от четкости описания местонахождения ДТП. От указанного числа пострадавших зависит количество автомобилей скорой медицинской помощи, которые требуются на месте ДТП. Сведения о наличии или отсутствии у пострадавших сознания, дыхания, кровообращения, а также сильного кровотечения, переломов и других травм необходимы диспетчеру для определения специализации бригады скорой медицинской помощи.'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

pictures = [
        ['none'
        ,'resur/1-2.jpg'
        ,'resur/1-3.jpg'
        ,'resur/1-4.jpg'
        ,'resur/1-5.jpg'
        ,'none'
        ,'none'
        ,'resur/1-8.jpg'
        ,'resur/1-9.jpg'
        ,'resur/1-10.jpg'
        ,'resur/1-11.jpg'
        ,'resur/1-12.jpg'
        ,'resur/1-13.jpg'
        ,'resur/1-14.jpg'
        ,'resur/1-15.jpg'
        ,'resur/1-16.jpg'
        ,'none'
        ,'none'
        ,'none'
        ,'none'],
        ['resur/2-1.jpg'
        ,'resur/2-2.jpg'
        ,'resur/2-3.jpg'
        ,'resur/2-4.jpg'
        ,'resur/2-5.jpg'
        ,'resur/2-6.jpg'
        ,'resur/2-7.jpg'
        ,'resur/2-8.jpg'
        ,'resur/2-9.jpg'
        ,'none'
        ,'resur/2-11.jpg'
        ,'resur/2-12.jpg'
        ,'resur/2-13.jpg'
        ,'resur/2-14.jpg'
        ,'resur/2-15.jpg'
        ,'resur/2-16.jpg'
        ,'none'
        ,'none'
        ,'none'
        ,'none'],
        ['resur/3-1.jpg'
        ,'resur/3-2.jpg'
        ,'resur/3-3.jpg'
        ,'resur/3-4.jpg'
        ,'resur/3-5.jpg'
        ,'resur/3-6.jpg'
        ,'none'
        ,'resur/3-8.jpg'
        ,'resur/3-9.jpg'
        ,'resur/3-10.jpg'
        ,'none'
        ,'resur/3-12.jpg'
        ,'resur/3-13.jpg'
        ,'resur/3-14.jpg'
        ,'resur/3-15.jpg'
        ,'resur/3-16.jpg'
        ,'none'
        ,'none'
        ,'none'
        ,'none'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

