questions = [
        [
        'Билет 1 - Вопрос 1\n\
В каком случае водитель совершит вынужденную остановку?\n\
1. Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу.\n\
2. Остановившись на проезжей части из-за технической неисправности транспортного средства.\n\
3. В обоих перечисленных случаях.'
        ,'Билет 1 - Вопрос 2\n\
Разрешен ли Вам съезд на дорогу с грунтовым покрытием?\n\
1. Разрешен.\n\
2. Разрешен только при технической неисправности транспортного средства.\n\
3. Запрещен.'
        ,'Билет 1 - Вопрос 3\n\
Можно ли Вам остановиться в указанном месте для посадки пассажира?\n\
1. Можно.\n\
2. Можно, если Вы управляете такси.\n\
3. Нельзя.'
        ,'Билет 1 - Вопрос 4\n\
Какие из указанных знаков запрещают движение водителям мопедов?\n\
1. Только А.\n\
2. Только Б.\n\
3. В и Г.\n\
4. Все.'
        ,'Билет 1 - Вопрос 5\n\
Вы намерены повернуть налево. Где следует остановиться, чтобы уступить дорогу легковому автомобилю?\n\
1. Перед знаком.\n\
2. Перед перекрестком у линии разметки.\n\
3. На перекрестке перед прерывистой линией разметки.\n\
4. В любом месте по усмотрению водителя.'
        ,'Билет 1 - Вопрос 6\n\
Что означает мигание зеленого сигнала светофора?\n\
1. Предупреждает о неисправности светофора.\n\
2. Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал.\n\
3. Запрещает дальнейшее движение.'
        ,'Билет 1 - Вопрос 7\n\
Водитель обязан подавать сигналы световыми указателями поворота (рукой):\n\
1. Перед началом движения или перестроением.\n\
2. Перед поворотом или разворотом.\n\
3. Перед остановкой.\n\
4. Во всех перечисленных случаях.'
        ,'Билет 1 - Вопрос 8\n\
Как Вам следует поступить при повороте направо?\n\
1. Перестроиться на правую полосу, затем осуществить поворот.\n\
2. Продолжить движение по второй полосе до перекрестка, затем повернуть.\n\
3. Возможны оба варианта действий.'
        ,'Билет 1 - Вопрос 9\n\
По какой траектории Вам разрешено выполнить разворот?\n\
1. Только по А.\n\
2. Только по Б.\n\
3. По любой из указанных.'
        ,'Билет 1 - Вопрос 10\n\
С какой скоростью Вы можете продолжить движение вне населенного пункта по левой полосе на легковом автомобиле?\n\
1. Не более 50 км/ч.\n\
2. Не менее 50 км/ч и не более 70 км/ч.\n\
3. Не менее 50 км/ч и не более 90 км/ч.'
        ,'Билет 1 - Вопрос 11\n\
Можно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?\n\
1. Можно.\n\
2. Можно, если скорость грузовых автомобилей менее 30 км/ч.\n\
3. Нельзя.'
        ,'Билет 1 - Вопрос 12\n\
В каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?\n\
1. Только если расстояние до сплошной линии разметки не менее 3 м.\n\
2. Только если расстояние до края пересекаемой проезжей части не менее 5 м.\n\
3. При соблюдении обоих перечисленных условий.'
        ,'Билет 1 - Вопрос 13\n\
При повороте направо Вы должны уступить дорогу:\n\
1. Только велосипедисту.\n\
2. Только пешеходам.\n\
3. Пешеходам и велосипедисту.\n\
4. Никому.'
        ,'Билет 1 - Вопрос 14\n\
Вы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?\n\
1. Обоим трамваям.\n\
2. Только трамваю А.\n\
3. Только трамваю Б.\n\
4. Никому.'
        ,'Билет 1 - Вопрос 15\n\
Кому Вы обязаны уступить дорогу при повороте налево?\n\
1. Только автобусу.\n\
2. Только легковому автомобилю.\n\
3. Никому.'
        ,'Билет 1 - Вопрос 16\n\
С какой максимальной скоростью можно продолжить движение за знаком?\n\
1. 60 км/ч.\n\
2. 50 км/ч.\n\
3. 30 км/ч.\n\
4. 20 км/ч.'
        ,'Билет 1 - Вопрос 17\n\
Для перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:\n\
1. Категории «A» или подкатегории «A1».\n\
2. Любой категории или подкатегории в течение двух и более лет.\n\
3. Только категории «A» или подкатегории «A1» в течение двух и более лет.'
        ,'Билет 1 - Вопрос 18\n\
При какой неисправности разрешается эксплуатация транспортного средства?\n\
1. Не работают пробки топливных баков.\n\
2. Не работает механизм регулировки положения сиденья водителя.\n\
3. Не работают устройства обогрева и обдува стекол.\n\
4. Не работает стеклоподъемник.'
        ,'Билет 1 - Вопрос 19\n\
В случае, когда правые колеса автомобиля наезжают на неукрепленную влажную обочину, рекомендуется:\n\
1. Затормозить и полностью остановиться.\n\
2. Затормозить и плавно направить автомобиль на проезжую часть.\n\
3. Не прибегая к торможению, плавно направить автомобиль на проезжую часть.'
        ,'Билет 1 - Вопрос 20\n\
Что понимается под временем реакции водителя?\n\
1. Время с момента обнаружения водителем опасности до полной остановки транспортного средства.\n\
2. Время с момента обнаружения водителем опасности до начала принятия мер по ее избежанию.\n\
3. Время, необходимое для переноса ноги с педали управления подачей топлива на педаль тормоза.'],
        ['Билет 2 - Вопрос 1\n\
Картинка к вопросу\n\
Сколько полос для движения имеет данная дорога?\n\
1. Две.\n\
2. Четыре.\n\
3. Пять.'
        ,'Билет 2 - Вопрос 2\n\
Картинка к вопросу\n\
Можно ли Вам въехать на мост первым?\n\
1. Можно.\n\
2. Можно, если Вы не затрудните движение встречному автомобилю.\n\
3. Нельзя.'
        ,'Билет 2 - Вопрос 3\n\
Картинка к вопросу\n\
Разрешено ли Вам произвести остановку для посадки пассажира?\n\
1. Разрешено.\n\
2. Разрешено только по четным числам месяца.\n\
3. Разрешено только по нечетным числам месяца.\n\
4. Запрещено.'
        ,'Билет 2 - Вопрос 4\n\
Картинка к вопросу\n\
Что запрещено в зоне действия этого знака?\n\
1. Движение любых транспортных средств.\n\
2. Движение всех транспортных средств со скоростью не более 20 км/ч.\n\
3. Движение механических транспортных средств.'
        ,'Билет 2 - Вопрос 5\n\
Картинка к вопросу\n\
Разрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?\n\
1. Разрешен.\n\
2. Разрешен, если скорость автобуса менее 30 км/ч.\n\
3. Запрещен.'
        ,'Билет 2 - Вопрос 6\n\
Картинка к вопросу\n\
В каких направлениях Вам разрешается продолжить движение?\n\
1. Только налево.\n\
2. Прямо и налево.\n\
3. Налево и в обратном направлении.'
        ,'Билет 2 - Вопрос 7\n\
Картинка к вопросу\n\
Поднятая вверх рука водителя легкового автомобиля является сигналом, информирующим Вас о его намерении:\n\
1. Повернуть направо.\n\
2. Продолжить движение прямо.\n\
3. Снизить скорость, чтобы остановиться и уступить дорогу мотоциклу.'
        ,'Билет 2 - Вопрос 8\n\
Картинка к вопросу\n\
Двигаясь по левой полосе, водитель намерен перестроиться на правую. На каком из рисунков показана ситуация, в которой он обязан уступить дорогу?\n\
1. На левом.\n\
2. На правом.\n\
3. На обоих.'
        ,'Билет 2 - Вопрос 9\n\
Картинка к вопросу\n\
Можно ли Вам выполнить разворот в этом месте?\n\
1. Можно.\n\
2. Можно только при отсутствии приближающегося поезда.\n\
3. Нельзя.'
        ,'Билет 2 - Вопрос 10\n\
Картинка к вопросу\n\
В каких случаях разрешается наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?\n\
1. Только если на дороге нет других транспортных средств.\n\
2. Только при движении в темное время суток.\n\
3. Только при перестроении.\n\
4. Во всех перечисленных случаях.'
        ,'Билет 2 - Вопрос 11\n\
Картинка к вопросу\n\
Разрешено ли Вам обогнать мотоцикл?\n\
1. Разрешено.\n\
2. Разрешено, если водитель мотоцикла снизил скорость.\n\
3. Запрещено.'
        ,'Билет 2 - Вопрос 12\n\
Картинка к вопросу\n\
Разрешается ли Вам остановиться в указанном месте?\n\
1. Разрешается.\n\
2. Разрешается, если автомобиль будет находиться не ближе 5 м от края пересекаемой проезжей части.\n\
3. Запрещается.'
        ,'Билет 2 - Вопрос 13\n\
Картинка к вопросу\n\
Вы намерены повернуть налево. Кому Вы должны уступить дорогу?\n\
1. Только пешеходам.\n\
2. Только автобусу.\n\
3. Автобусу и пешеходам.'
        ,'Билет 2 - Вопрос 14\n\
Картинка к вопросу\n\
В каком случае Вы имеете преимущество?\n\
1. Только при повороте направо.\n\
2. Только при повороте налево.\n\
3. В обоих перечисленных случаях.'
        ,'Билет 2 - Вопрос 15\n\
Картинка к вопросу\n\
Обязан ли водитель мотоцикла уступить Вам дорогу?\n\
1. Обязан.\n\
2. Не обязан.'
        ,'Билет 2 - Вопрос 16\n\
Картинка к вопросу\n\
Разрешается ли водителю выполнить объезд грузового автомобиля?\n\
1. Разрешается.\n\
2. Разрешается, если между шлагбаумом и остановившимся грузовым автомобилем расстояние более 5 м.\n\
3. Запрещается.'
        ,'Билет 2 - Вопрос 17\n\
Картинка к вопросу\n\
В каких из перечисленных случаев запрещена буксировка на гибкой сцепке?\n\
1. Только на горных дорогах.\n\
2. Только в гололедицу.\n\
3. Только в темное время суток и в условиях недостаточной видимости.\n\
4. Во всех перечисленных случаях.'
        ,'Билет 2 - Вопрос 18\n\
Картинка к вопросу\n\
Запрещается эксплуатация мототранспортных средств (категории L), если остаточная глубина рисунка протектора шин (при отсутствии индикаторов износа) составляет не более:\n\
1. 0,8 мм.\n\
2. 1,0 мм.\n\
3. 1,6 мм.\n\
4. 2,0 мм.'
        ,'Билет 2 - Вопрос 19\n\
Картинка к вопросу\n\
Исключает ли антиблокировочная тормозная система возможность возникновения заноса или сноса при прохождении поворота?\n\
1. Полностью исключает возможность возникновения только заноса.\n\
2. Полностью исключает возможность возникновения только сноса.\n\
3. Не исключает возможность возникновения сноса или заноса.'
        ,'Билет 2 - Вопрос 20\n\
Картинка к вопросу\n\
В каких случаях следует начинать сердечно-легочную реанимацию пострадавшего?\n\
1. При наличии болей в области сердца и затрудненного дыхания.\n\
2. При отсутствии у пострадавшего сознания, независимо от наличия дыхания.\n\
3. При отсутствии у пострадавшего сознания, дыхания и кровообращения.'],
        [''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
        ]
answers = [
        ['2'
        ,'1'
        ,'1'
        ,'4'
        ,'2'
        ,'2'
        ,'4'
        ,'3'
        ,'1'
        ,'3'
        ,'1'
        ,'3'
        ,'3'
        ,'1'
        ,'3'
        ,'4'
        ,'3'
        ,'4'
        ,'3'
        ,'2'],
        ['2'
        ,'1'
        ,'1'
        ,'3'
        ,'3'
        ,'1'
        ,'3'
        ,'3'
        ,'1'
        ,'3'
        ,'3'
        ,'2'
        ,'3'
        ,'3'
        ,'1'
        ,'3'
        ,'2'
        ,'1'
        ,'3'
        ,'3'],
        [''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

choices = [
        ['3','3','3','4','4','3','4','3','3','3','3','3','4','4','3','4','3','4','3','3'],
        ['3','3','4','3','3','3','3','3','3','4','3','3','3','3','3','3','4','4','3','3'],
        [''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''],
        ['','','','','','','','','','','','','','','','','','','',''],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

comments = [
        ['Под вынужденной остановкой подразумевается прекращение движения ТС из-за его технической неисправности, опасности, создаваемой перевозимым грузом, внезапным ухудшением состояния водителя (или пассажира), а также появлением препятствия на дороге (упавший груз, завал на дороге и т. п.). Остановка, связанная с необходимостью выполнения требования уступить дорогу, не рассматривается как вынужденная (п. 1.2).'
        ,'Знаки 1.11.2  «Опасный поворот» и 1.34.2  «Направление поворота» указывают направление движения на закруглениях дороги малого радиуса с ограниченной видимостью, или, как их называют, «закрытых» поворотах. Эти знаки не ограничивают возможность съезда с дороги, в данном случае - на примыкающую справа грунтовую дорогу.'
        ,'Знак 3.28  «Стоянка запрещена» остановку не запрещает, поэтому Вы можете остановиться в указанном месте.'
        ,'Все указанные знаки запрещают движение водителям мопедов.'
        ,'Разметка 1.13  (в виде линии из треугольников) наносится поперек полосы движения и указывает место, где Вы должны при необходимости остановиться, выполняя требование знака 2.4  «Уступите дорогу» и предоставляя преимущество ТС, движущимся по пересекаемой дороге.'
        ,'Для информирования водителей о предстоящей смене зеленого сигнала светофора на желтый Правилами предусмотрена возможность мигания зеленого сигнала. Этот сигнал разрешает движение ТС (п. 6.2). Длительность мигания при этом должна составлять 3 сек.'
        ,'Перед началом движения, перестроением, поворотом (разворотом) и остановкой водитель обязан подавать сигналы световыми указателями поворота соответствующего направления, а если они отсутствуют или неисправны - рукой. (п. 8.1).'
        ,'Стрелы разметки 1.18  указывают, что на данном перекрестке поворот направо может осуществляться не только с правой, но и с левой полосы. Следовательно, Вы можете выполнить поворот, либо заранее перестроившись на крайнюю правую полосу (занять крайнее правое положение), либо продолжив движение по левой полосе (п. 8.5).'
        ,'Выполняя разворот на этом перекрестке, Вам придется использовать для движения участок проезжей части, имеющий двустороннее движение. Речь идет о пересекаемой Вами проезжей части. На ней двустороннее движение. Если Вы поедете по траектории Б, то попадете навстречу легковому автомобилю слева. Поэтому, въезжая на перекресток, Вы можете продолжить движение только по правой стороне этого участка проезжей части (п. 1.4), т.е. по траектории А.'
        ,'Знак 4.6  «Ограничение минимальной скорости» и табличка 8.14  «Полоса движения» предписывают двигаться по левой полосе со скоростью не менее 50 км/ч. Однако при этом на дороге вне населенного пункта, не относящейся к автомагистрали, Вы не имеете права развивать скорость на легковом автомобиле более 90 км/ч (п. 10.3).'
        ,'Вне населенных пунктов водители ТС должны вести их по возможности ближе к правому краю проезжей части. Однако можно последовательно опередить несколько ТС, следующих друг за другом на незначительной дистанции. Поскольку водитель легкового автомобиля приближается к перекрестку неравнозначных дорог, двигаясь по главной дороге (знак 2.3.1  «Пересечение со второстепенной дорогой»), имеющей 2 полосы для движения в данном направлении, то он может совершить опережение обоих грузовых автомобилей (п. 9.4).'
        ,'Остановившись за пешеходным переходом в 5 м от края пересекаемой проезжей части и обеспечив при этом расстояние в 3 м до сплошной линии разметки, водитель не нарушил правила стоянки (пп. 12.4 и 12.5).'
        ,'При повороте направо по разрешающему сигналу светофора Вы должны уступить дорогу как велосипедисту, так и пешеходам (п. 13.1).'
        ,'В данной ситуации Вы должны уступить дорогу обоим трамваям, так как на перекрестке равнозначных дорог трамвай имеет преимущество перед безрельсовыми ТС независимо от направления его движения (п. 13.11).'
        ,'Проезжая данный перекресток неравнозначных дорог по направлению главной дороги (знаки 2.1  «Главная дорога» и 8.13  «Направление главной дороги»), Вы никому не должны уступать дорогу, так как пользуетесь преимуществом как перед находящимся на главной дороге автобусом, для которого Вы являетесь «помехой справа» (пп. 13.10 и 13.11), так и перед легковым автомобилем, движущимся по второстепенной дороге (п. 13.9).'
        ,'Знак 5.21  «Жилая зона» показывает, что Вы въезжаете на территорию, где скорость не должна превышать 20 км/ч (п. 10.2).'
        ,'Перевозка людей на мотоцикле должна осуществляться водителем, имеющим водительское удостоверение на право управления ТС категории «A» или подкатегории «A1» в течение двух и более лет (п. 22.21).'
        ,'Из всех перечисленных неисправностей только неработающий стеклоподъемник не является причиной запрещения эксплуатации ТС. Остальные неисправности включены в Перечень (п. 7.4), и при их наличии эксплуатация ТС запрещена.'
        ,'При съезде автомобиля правыми колесами на неукрепленную и влажную обочину возникает опасность заноса из-за разницы сцепления правых и левых колес с дорогой. При этом целесообразно, не меняя скорости, т.е. не прибегая к торможению, плавным поворотом рулевого колеса вернуть автомобиль на проезжую часть. Торможение в данной ситуации может вызвать занос автомобиля.'
        ,'Под временем реакции водителя подразумевается время с момента обнаружения опасности до начала принятия мер по избежанию опасности. В зависимости от состояния водителя и его опыта, а также сложности обстановки, в которой он находится, это время обычно составляет от 0,4 до 1,6 секунды.'],
        ['При наличии разделительной полосы дорога имеет две проезжие части, каждая из которых разделена разметкой на две полосы (п. 1.2).'
        ,'Знак 2.7  «Преимущество перед встречным движением» дает Вам право первым въехать на узкий мост, поскольку водитель встречного автомобиля в этой ситуации должен уступить дорогу тем, кто находится не только на мосту, но и на противоположном подъезде к нему.'
        ,'Знак 3.29  «Стоянка запрещена по нечетным числам месяца» запрещает только стоянку. Следовательно, остановиться в этом месте, в том числе и для посадки пассажиров, Вы можете в любой день месяца.'
        ,'Знак 5.33  «Пешеходная зона» обозначает место, с которого начинается территория (участок дороги), на которой разрешено движение только пешеходов, а также велосипедистов в случаях, установленных в пп. 24.2 - 24.4 Правил. Таким образом, запрещено движение только механических ТС. (Изменения от 25 июля 2017 года).'
        ,'В случае, если реверсивные светофоры выключены, въезд на полосу, обозначенную с двух сторон разметкой 1.9 , запрещен (п. 6.7).'
        ,'Дополнительная секция с включенным сигналом в виде зеленой стрелки, знак 5.15.1  "Направления движения по полосам" и разметка 1.18  разрешают Вам с правой полосы только поворот налево. Движение прямо запрещает красный сигнал светофора, а разворот запрещен, так как правила предписывают производить разворот только с крайней левой полосы (п. 8.5). Поворот направо запрещен при любом сигнале.'
        ,'Для выполнения требования знака 2.4  «Уступите дорогу» водитель легкового автомобиля должен снизить скорость и остановиться, чтобы уступить дорогу мотоциклисту. Об этом он и информирует Вас поднятой вверх рукой (п. 8.1).'
        ,'При перестроении с левой полосы на правую водитель должен уступить дорогу легковому автомобилю, движущемуся по правой полосе, как при его движении прямо, так и в случае одновременного перестроения (п. 8.4).'
        ,'Разворот запрещен непосредственно на самих железнодорожных переездах (п. 8.11). Перед переездом разворот разрешен.'
        ,'Наезжать на прерывистые линии разметки разрешается только при перестроении (п. 9.7).'
        ,'Водитель мотоцикла и Вы приближаетесь к нерегулируемому перекрестку равнозначных дорог, на котором обгон запрещен (п. 11.4). Кроме того, справа находится легковой автомобиль, которому водитель мотоцикла и Вы обязаны уступить дорогу (п. 13.11).'
        ,'Вам разрешается остановиться в указанном месте только в том случае, если автомобиль будет находиться не ближе 5 м от края пересекаемой проезжей части, т.е расстояние от остановившегося автомобиля как спереди, так и сзади него до соответствующего края пересекаемой проезжей части будет составлять не менее 5 м (п. 12.4).'
        ,'Перекресток, на который Вы въезжаете, - регулируемый, поэтому очередность движения на нем определяется не знаками приоритета, а сигналами светофора (пп. 6.15 и 13.3). Поворачивая налево, Вы должны уступить дорогу автобусу, движущемуся со встречного направления прямо (п. 13.4), а завершая поворот,— и пешеходам, переходящим проезжую часть дороги, на которую Вы поворачиваете (п. 13.1).'
        ,'Находящийся слева грузовой автомобиль должен уступить Вам дорогу (п. 13.11), и поэтому данный перекресток равнозначных дорог Вы проедете первым независимо от направления движения.'
        ,'Вы находитесь на автомагистрали, о чем свидетельствует знак 5.1  «Автомагистраль», а мотоцикл въезжает на нее по полосе разгона. Автомагистраль является главной дорогой по отношению к примыкающим (пп. 13.9 и 1.2 , термин «Главная дорога»). В данной ситуации водитель мотоцикла должен уступить Вам дорогу (п. 8.10).'
        ,'Водитель грузового автомобиля остановился перед железнодорожным переездом, а объезд стоящих перед переездом ТС с выездом на полосу встречного движения запрещен (п. 15.3).'
        ,'Буксировка на гибкой сцепке запрещена только в гололедицу (п. 20.4) из-за высокой вероятности заноса при торможении или трогании с места.'
        ,'Для мототранспортных средств, относящихся к ТС категории L, остаточная глубина рисунка протектора шин, при которой запрещается эксплуатация ТС, составляет не более 0,8 мм (Перечень, п. 5.1).'
        ,'При прохождении поворота на ТС действует центробежная сила, которая возрастает с увеличением скорости и стремится сместить ТС к внешней стороне закругления дороги. Занос или снос ТС может возникнуть при проезде поворота из-за большой скорости движения, торможения или низкого коэффициента сцепления. Антиблокировочная тормозная система, предназначенная для предотвращения блокировки колес ТС, может снизить вероятность возникновения заноса или сноса при торможении, но не может исключить возможность их возникновения.'
        ,'Сердечно-легочная реанимация проводится только при отсутствии у пострадавшего признаков жизни: потере сознания, отсутствии пульса на сонной артерии, а также признаков дыхания.'],
        [''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

pictures = [
        ['none'
        ,'resur/1-2.jpg'
        ,'resur/1-3.jpg'
        ,'resur/1-4.jpg'
        ,'resur/1-5.jpg'
        ,'none'
        ,'none'
        ,'resur/1-8.jpg'
        ,'resur/1-9.jpg'
        ,'resur/1-10.jpg'
        ,'resur/1-11.jpg'
        ,'resur/1-12.jpg'
        ,'resur/1-13.jpg'
        ,'resur/1-14.jpg'
        ,'resur/1-15.jpg'
        ,'resur/1-16.jpg'
        ,'none'
        ,'none'
        ,'none'
        ,'none'],
        ['resur/2-1.jpg'
        ,'resur/2-2.jpg'
        ,'resur/2-3.jpg'
        ,'resur/2-4.jpg'
        ,'resur/2-5.jpg'
        ,'resur/2-6.jpg'
        ,'resur/2-7.jpg'
        ,'resur/2-8.jpg'
        ,'resur/2-9.jpg'
        ,'none'
        ,'resur/2-11.jpg'
        ,'resur/2-12.jpg'
        ,'resur/2-13.jpg'
        ,'resur/2-14.jpg'
        ,'resur/2-15.jpg'
        ,'resur/2-16.jpg'
        ,'none'
        ,'none'
        ,'none'
        ,'none'],
        [''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''
        ,''],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'],
        ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20']
]

